In [1]:
import pandas as pd
import numpy as np

In [4]:
people = {
    'first' : ['Anurag', 'Jane', 'John', 'Chris',np.nan, None, 'NA'],
    'last' : ['Timilsina', 'Doe', 'Doe', 'Pratt', np.nan, np.nan, 'Missing'],
    'email' : ['anurag.timilsina@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com',None,np.nan,np.nan,'Missing'],
    'age' : ['20','55','63','36',None,None,'Missing']
}

In [28]:
df = pd.DataFrame(people)

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [29]:
df

    first       last                       email   age
0  Anurag  Timilsina  anurag.timilsina@gmail.com    20
1    Jane        Doe           JaneDoe@gmail.com    55
2    John        Doe           JohnDoe@gmail.com    63
3   Chris      Pratt                        None    36
4     NaN        NaN                         NaN  None
5    None        NaN                         NaN  None
6     NaN        NaN                         NaN   NaN

In [30]:
 df.dropna()

    first       last                       email age
0  Anurag  Timilsina  anurag.timilsina@gmail.com  20
1    Jane        Doe           JaneDoe@gmail.com  55
2    John        Doe           JohnDoe@gmail.com  63

In [31]:
df.dropna(axis='index', how='all')

    first       last                       email age
0  Anurag  Timilsina  anurag.timilsina@gmail.com  20
1    Jane        Doe           JaneDoe@gmail.com  55
2    John        Doe           JohnDoe@gmail.com  63
3   Chris      Pratt                        None  36

In [32]:
df.dropna(axis='columns',how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [33]:
 df.dropna(axis='index',how='any',subset=['email'])

    first       last                       email age
0  Anurag  Timilsina  anurag.timilsina@gmail.com  20
1    Jane        Doe           JaneDoe@gmail.com  55
2    John        Doe           JohnDoe@gmail.com  63

In [34]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

    first       last                       email age
0  Anurag  Timilsina  anurag.timilsina@gmail.com  20
1    Jane        Doe           JaneDoe@gmail.com  55
2    John        Doe           JohnDoe@gmail.com  63
3   Chris      Pratt                        None  36

In [35]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True   True   True
6   True   True   True   True

In [36]:
df.fillna('MISSING')

     first       last                       email      age
0   Anurag  Timilsina  anurag.timilsina@gmail.com       20
1     Jane        Doe           JaneDoe@gmail.com       55
2     John        Doe           JohnDoe@gmail.com       63
3    Chris      Pratt                     MISSING       36
4  MISSING    MISSING                     MISSING  MISSING
5  MISSING    MISSING                     MISSING  MISSING
6  MISSING    MISSING                     MISSING  MISSING

In [37]:
df.fillna(0)

    first       last                       email age
0  Anurag  Timilsina  anurag.timilsina@gmail.com  20
1    Jane        Doe           JaneDoe@gmail.com  55
2    John        Doe           JohnDoe@gmail.com  63
3   Chris      Pratt                           0  36
4       0          0                           0   0
5       0          0                           0   0
6       0          0                           0   0

In [38]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [39]:
type(np.nan)

float

In [41]:
df['age'] = df['age'].astype(float)

In [42]:
df['age'].mean()

43.5